let HM = new Map([
  ["个", "837"],
  ["幽", "3323"],
  ["默", "1891"],
  ["冷", "1571"],
  ["笑", "3011"],
  ["话", "1049"],
  ["一", "3220"],
  ["口", "1467"],
  ["吃", "333"],
  ["的", "505"],
  ["监", "1191"],
  ["考", "1437"],
  ["老", "1550"],
  ["师", "2448"],
  ["发", "659"],
  ["现", "2965"],
  ["学", "3106"],
  ["生", "2438"],
  ["在", "3439"],
  ["作", "3750"],
  ["弊", "148"],
  ["便", "160"],
  ["气", "2155"],
  ["急", "1144"],
  ["败", "59"],
  ["坏", "1054"],
  ["地", "525"],
  ["指", "3593"],
  ["着", "3700"],
  ["那", "1918"],
  ["吼", "1019"],
  ["道", "501"],
  ["你", "1946"],
  ["竟", "1340"],
  ["敢", "801"],
  ["站", "3505"],
  ["起", "2147"],
  ["来", "1523"],
  ["刚", "804"],
  ["说", "2557"],
  ["完", "2797"],
  ["有", "3335"],
  ["名", "1876"],
  ["了", "1640"],
  ["觉", "1400"],
  ["得", "504"],
  ["人", "2297"],
  ["喜", "2929"],
  ["欢", "1055"],
  ["可", "1450"],
  ["能", "1939"],
  ["是", "2481"],
  ["错", "452"],
  ["感", "799"],
  ["讨", "2684"],
  ["厌", "3164"],
  ["十", "2456"],
  ["八", "42"],
  ["九", "1352"],
  ["真", "3545"],
  ["如", "2325"],
  ["果", "936"],
  ["没", "1812"],
  ["朋", "2056"],
  ["友", "3336"],
  ["就", "1360"],
  ["去", "2259"],
  ["找", "3525"],
  ["表", "170"],
  ["白", "54"],
  ["对", "615"],
  ["方", "686"],
  ["会", "1098"],
  ["提", "2695"],
  ["出", "367"],
  ["和", "984"],
  ["做", "3749"],
  ["男", "1927"],
  ["百", "56"],
  ["依", "3225"],
  ["顺", "2555"],
  ["从", "426"],
  ["不", "214"],
  ["沾", "3495"],
  ["花", "1041"],
  ["惹", "2293"],
  ["草", "248"],
  ["因", "3275"],
  ["为", "2827"],
  ["他", "2627"],
  ["钱", "2174"],
  ["够", "872"],
  ["我", "2867"],
  ["物", "2896"],
  ["质", "3611"],
  ["女", "1987"],
  ["但", "480"],
  ["自", "3715"],
  ["己", "1153"],
  ["什", "2460"],
  ["么", "1805"],
  ["让", "2289"],
  ["眼", "3158"],
  ["前", "2176"],
  ["亮", "1630"],
  ["电", "540"],
  ["焊", "963"],
  ["仅", "1307"],
  ["还", "1058"],
  ["以", "3245"],
  ["瞎", "2936"],
  ["用", "3322"],
  ["当", "486"],
  ["然", "2281"],
  ["买", "1773"],
  ["到", "498"],
  ["快", "1485"],
  ["乐", "1557"],
  ["只", "3596"],
  ["要", "3203"],
  ["别", "173"],
  ["想", "2986"],
  ["办", "75"],
  ["法", "665"],
  ["时", "2459"],
  ["候", "1021"],
  ["定", "571"],
  ["好", "974"],
  ["哄", "1008"],
  ["她", "2629"],
  ["给", "839"],
  ["等", "509"],
  ["饱", "98"],
  ["才", "224"],
  ["力", "1603"],
  ["打", "457"],
  ["撩", "1632"],
  ["突", "2750"],
  ["理", "1580"],
  ["们", "1824"],
  ["大", "458"],
  ["面", "1855"],
  ["积", "1126"],
  ["撒", "2340"],
  ["网", "2811"],
  ["选", "3100"],
  ["择", "3462"],
  ["性", "3057"],
  ["捕", "209"],
  ["捞", "1547"],
  ["而", "651"],
  ["被", "120"],
  ["放", "694"],
  ["所", "2625"],
  ["谓", "2846"],
  ["神", "2429"],
  ["种", "3623"],
  ["看", "1429"],
  ["知", "3579"],
  ["这", "3541"],
  ["辈", "111"],
  ["子", "3714"],
  ["跟", "841"],
  ["半", "74"],
  ["毛", "1796"],
  ["关", "901"],
  ["系", "2932"],
  ["都", "591"],
  ["问", "2859"],
  ["难", "1928"],
  ["结", "1286"],
  ["婚", "1106"],
  ["房", "688"],
  ["贷", "466"],
  ["车", "302"],
  ["吗", "1771"],
  ["后", "1022"],
  ["担", "472"],
  ["柴", "268"],
  ["米", "1840"],
  ["油", "3332"],
  ["盐", "3145"],
  ["酱", "1241"],
  ["醋", "430"],
  ["茶", "259"],
  ["支", "3576"],
  ["再", "3438"],
  ["几", "1151"],
  ["孩", "941"],
  ["牛", "1976"],
  ["马", "1768"],
  ["精", "1326"],
  ["辟", "150"],
  ["留", "1681"],
  ["言", "3151"],
  ["太", "2641"],
  ["年", "1953"],
  ["轻", "2225"],
  ["长", "285"],
  ["象", "2994"],
  ["负", "777"],
  ["责", "3461"],
  ["带", "463"],
  ["娃", "2785"],
  ["死", "2568"],
  ["保", "96"],
  ["佑", "3338"],
  ["吉", "1137"],
  ["利", "1594"],
  ["财", "225"],
  ["位", "2844"],
  ["把", "48"],
  ["挖", "2781"],
  ["换", "1060"],
  ["埋", "1772"],
  ["2", "N2"],
  ["0", "N0"],
  ["1", "N1"],
  ["5", "N5"],
  ["3", "N3"],
  ["4", "N4"],
  ["6", "N6"],
  ["7", "N7"],
  ["8", "N8"],
  ["9", "N9"],
  [":", "A4"],
  [".", "A0"],
  [",", "A1"],
  ["：", "A23"],
  ["“", "A24"],
  ["…", "A16"],
  ["！", "A21"],
  ["”", "A25"],
  ["。", "A19"],
  ["？", "A20"],
]);
var TMP = new Array(),
  chunks = new String(),
  events = [7],
  pageS;
var page = 1;
//const TXT =
//  "你你你你你你好好好你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你世界界";
const TXT =
  "20个幽默冷笑话:1.一口吃的监考老师,发现一个学生在作弊,便气急败坏地指着那学生吼道：“你…你…你…你…你竟敢作弊,站起来！”话刚说完,有5名学生站了起来。2.觉得有人喜欢你,可能是错觉,感觉有人讨厌你,十有八九是真的。3.如果觉得没有朋友,就去找喜欢的人表白,对方会提出和你做朋友的。4.如果你的男朋友对你百依百顺,从不沾花惹草,可能是因为他钱不够。5.我讨厌物质的女生,但如果是你,我讨厌没钱的自己。6.学什么能让女生眼前一亮？学电焊,不仅眼前一亮,还可以亮瞎。7.用钱当然买不到快乐,但是只要你有钱,别人想办法让你快乐。8.女朋友生气的时候,你一定要好好哄她,买好吃的给她吃。等她吃饱了,才有力气打你。9.为什么有的男生撩着撩着,突然就不理你了？因为他们是大面积撒网,选择性捕捞,而你被放生了。10.所谓男神女神,就是那种看一眼,就知道这辈子跟你半毛钱关系都不可能有的人。11.网友提问：“难道结婚就是为了还房贷车贷吗？”然后还要担起柴米油盐酱醋茶的支出,再生几个孩子,给他们做牛做马！精辟留言：你还是太年轻了,孩子长大后,你还要给他买车买房找对象,他们生孩子了,还要你负责给他们带娃。死后还得保佑他们大吉大利发大财,要是他们觉得保佑不到位,还可能把你挖出来换个地方埋。";
function regCommonEvent() {}
function splitTextByLength(text, length) {
  let result = [];
  for (let i = 0; i < text.length; i += length) {
    result.push(text.slice(i, i + length));
  }
  return result;
}

function loadTXT() {
  var i = 0;
  for (let i = 0; i < TMP.length; i++) {
    const element = TMP[i];
    if (i <= chunks[page - 1].length) {
      set_img_src(element, HM.get(chunks[page - 1][i]));
    } else {
      set_img_src(element, HM.get("米"));
    }
  }
  set_label_text(pageS, page.toString());
}
function resourceInit() {
  exitimg = create_img(0, "return.bin", 45, 10);
  addEvent(exitimg, events, exitImgCb);
  PAGEIMG = create_img(0, "PAGEA", 45, 370);
  nextimg = create_img(0, "NEXTPAGE", 45, 300);
  addEvent(nextimg, events, nextPAGE);
  //TMP = create_label_new(0, 96, " ");
  //set_img_src(a[0], HM.get("世").toString());
  Create_NO_TMP();
  chunks = splitTextByLength(TXT, 114);
  //create_label_new(72, 400, "PAGE:");

  a1 = create_label(0, 0, 420, 192, 10);
  set_label_font(a1, 4163);
  set_label_color(a1, "#f0d700");
  set_label_content_center(a1);
  set_label_text(a1, page.toString());
  pageS = a1;

  loadTXT();
}
function nextPAGE() {
  if (chunks.length > page) {
    page++;
  } else {
    page = 1;
  }

  loadTXT();
}

function Create_NO_TMP() {
  let labelList = [];
  var lastx = 0;
  var lasty = 96;

  var v = 1;
  for (let i = 0; i < 114; i++) {
    labelList.push(create_img(0, "0", lastx, lasty));

    if (v % 12 == 0) {
      v = 1;
      lasty += 16;
      lastx = 0;
    } else {
      lastx += 16;
      v++;
    }
  }

  TMP = labelList;
}
function exitImgCb() {
  exit_game();
}
function create_label_new(x = 0, y = 0, str) {
  let labelList = [];
  var lastx = x;
  var lasty = y;

  var v = 1;
  for (let i = 0; i < str.length; i++) {
    labelList.push(create_img(0, HM.get(str[i]), lastx, lasty));

    if (v % 12 == 0) {
      v = 1;
      lasty += 16;
      lastx = x;
    } else {
      lastx += 16;
      v++;
    }
  }

  return labelList;
}

function dataInit() {}
function main() {
  regCommonEvent();
  resourceInit();
  dataInit();
}
main();
